app/controllers/applications_controller.rb

    def index
        render json: Application.all
---
SELECT "applications".* FROM "applications"

    def show
        render json: Application.find(params[:id]), include:[:job, :user]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]